FEL/Request_33.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/" xmlns:tes="http://schemas.datacontract.org/2004/07/TES.V33.CFDI.Negocios">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:GenerarCFDI>
         <!--Optional:-->
         <tem:credenciales>
            <!--Optional:-->
            <tes:Cuenta>DEMO7008173R5</tes:Cuenta>
            <!--Optional:-->
            <tes:Password>DEMO7008173R5a+</tes:Password>
            <!--Optional:-->
            <tes:Usuario>DEMO7008173R5</tes:Usuario>
         </tem:credenciales>
         <!--Optional:-->
         <tem:cfdi>
            <!--Optional:-->
            <tes:ClaveCFDI>FAC</tes:ClaveCFDI>
            <!--Optional:-->
            <tes:Conceptos>
               <!--Zero or more repetitions:-->
               <tes:ConceptoR>
                  <!--Optional:-->
                  <tes:Cantidad>1.7</tes:Cantidad>
                  <!--Optional:-->
                  <tes:ClaveProdServ>01010101</tes:ClaveProdServ>
                  <!--Optional:-->
                  <tes:ClaveUnidad>F52</tes:ClaveUnidad>
                  <!--Optional:-->
                  <tes:Descripcion>ZAMAC</tes:Descripcion>
                  <!--Optional:-->
                  <tes:Importe>17000.00</tes:Importe>
                  <!--Optional:-->
                  <tes:Impuestos>
                     <!--Optional:-->
                     <tes:Traslados>
                        <!--Zero or more repetitions:-->
                        <tes:TrasladoConceptoR>
                           <!--Optional:-->
                           <tes:Base>17000</tes:Base>
                           <!--Optional:-->
                           <tes:Importe>2720.00</tes:Importe>
                           <!--Optional:-->
                           <tes:Impuesto>002</tes:Impuesto>
                           <!--Optional:-->
                           <tes:TasaOCuota>0.160000</tes:TasaOCuota>
                           <!--Optional:-->
                           <tes:TipoFactor>Tasa</tes:TipoFactor>
                        </tes:TrasladoConceptoR>
                     </tes:Traslados>
                  </tes:Impuestos>
                  <tes:NoIdentificacion>00003</tes:NoIdentificacion>
                  <!--Optional:-->
                  <tes:Unidad>TONELADA</tes:Unidad>
                  <!--Optional:-->
                  <tes:ValorUnitario>10000.00</tes:ValorUnitario>
                  <!--Optional:-->
               </tes:ConceptoR>
            </tes:Conceptos>
            <!--Optional:-->
            <tes:CondicionesDePago>CONDICIONES</tes:CondicionesDePago>
            <!--Optional:-->
            <tes:Emisor>
               <!--Optional:-->
               <tes:Nombre>HORACIO LLANOS</tes:Nombre>
               <!--Optional:-->
               <tes:RegimenFiscal>601</tes:RegimenFiscal>
            </tes:Emisor>
            <!--Optional:-->
            <tes:Fecha>2017-06-26T11:36:11</tes:Fecha>
            <!--Optional:-->
            <tes:Folio>167ABC</tes:Folio>
            <!--Optional:-->
            <tes:FormaPago>01</tes:FormaPago>
            <!--Optional:-->
            <tes:LugarExpedicion>45079</tes:LugarExpedicion>
            <!--Optional:-->
            <tes:MetodoPago>PUE</tes:MetodoPago>
            <!--Optional:-->
            <tes:Moneda>MXN</tes:Moneda>
            <!--Optional:-->
            <tes:Receptor>
               <!--Optional:-->
               <tes:Nombre>RAFAEL ALEJANDRO HERNÁNDEZ PALACIOS</tes:Nombre>
               <!--Optional:-->
               <tes:Rfc>TEST010203001</tes:Rfc>
               <!--Optional:-->
               <tes:UsoCFDI>G01</tes:UsoCFDI>
            </tes:Receptor>
            <!--Optional:-->
            <tes:Referencia>0001</tes:Referencia>
            <!--Optional:-->
            <tes:Serie>A</tes:Serie>
            <!--Optional:-->
            <tes:SubTotal>17000.00</tes:SubTotal>
            <!--Optional:-->
            <tes:TipoCambio>1.0</tes:TipoCambio>
            <!--Optional:-->
            <tes:Total>19720.00</tes:Total>
            <!--Optional:-->
         </tem:cfdi>
      </tem:GenerarCFDI>
   </soapenv:Body>
</soapenv:Envelope>